posts/2019/08/16/using-flyspell-and-emacspeak/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Using Flyspell and Emacspeak | Rill's Web Site</title>
<link href="../../../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../../../rss.xml">
<link rel="canonical" href="https://rillonline.github.io/posts/2019/08/16/using-flyspell-and-emacspeak/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Rill">
<link rel="prev" href="../../15/thinking-about-the-vine/" title="Thinking About the Vine" type="text/html">
<link rel="next" href="../../20/tab-completion-in-orgmode/" title="tab-completion-in-orgmode" type="text/html">
<meta property="og:site_name" content="Rill's Web Site">
<meta property="og:title" content="Using Flyspell and Emacspeak">
<meta property="og:url" content="https://rillonline.github.io/posts/2019/08/16/using-flyspell-and-emacspeak/">
<meta property="og:description" content="The Problem


I didn't have a great set up for spellchecking in Emacs. Ispell works,
but often there are too many choices and Emacspeak does not read them
out. So I investigated Flyspell and now I hav">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2019-08-16T21:46:31-05:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="https://rillonline.github.io/">

            <span id="blog-title">Rill's Web Site</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../../../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../../../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../../../../rss.xml" class="nav-link">RSS feed</a>
                </li>
<li class="nav-item">
<a href="../../../../../pages/long-form-writing/index.html" class="nav-link">Long Form Writing</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Using Flyspell and Emacspeak</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Rill
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2019-08-16T21:46:31-05:00" itemprop="datePublished" title="2019-08-16 21:46">2019-08-16 21:46</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-orge9990a5" class="outline-2">
<h2 id="orge9990a5">The Problem</h2>
<div class="outline-text-2" id="text-orge9990a5">
<p>
I didn't have a great set up for spellchecking in Emacs. Ispell works,
but often there are too many choices and Emacspeak does not read them
out. So I investigated Flyspell and now I have a working solution.
</p>
</div>
</div>

<div id="outline-container-org13f26ed" class="outline-2">
<h2 id="org13f26ed">The Hook</h2>
<div class="outline-text-2" id="text-org13f26ed">
<p>
I now have flyspell working in all text and text-derived buffers by
adding this hook:
</p>

<pre class="example">
(add-hook 'text-mode-hook 'flyspell-mode)
</pre>

<p>
This can be disabled in specific circumstances if needed but this is
beyond the scope of this article.
</p>
</div>
</div>

<div id="outline-container-org5dc9808" class="outline-2">
<h2 id="org5dc9808">Procedure to Correct Words in a Buffer</h2>
<div class="outline-text-2" id="text-org5dc9808">
<p>
There are keybindings to autocorrect in <code>flyspell</code>, but this is not
always advisable.
</p>

<p>
I needed to be able to scroll through the many options. <code>Ispell</code> gives
choices with numbers, but often there are too many to give you the
list. By putting the following command in my <code>init.el</code> file via the
customization menus, I am now able to use <code>flyspell</code> to cursor up and
down a list until I find the right choice. After that, I can just hit return.
</p>

<p>
If auditory icons is turned on and you are using the default theme,
you will hear something like a rattling sound when you misspell a word. To
correct the word immediately,
</p>

<ul class="org-ul">
<li>move point to the misspelled word.</li>
<li>Press c-c $. (control plus c then s plus 4)</li>
<li>Emacspeak will say menu. You can use your cursor keys to scroll up
and down the list of suggestions.</li>
<li>Press return on your selection.</li>
</ul>
<p>
As well as misspelled word suggestions, you can save your word in a
personal dictionary, accept your spelling for this session or accept
all misspelled words in the buffer.
</p>
</div>
</div>

<div id="outline-container-org4a2483a" class="outline-2">
<h2 id="org4a2483a">Spellchecking the Buffer</h2>
<div class="outline-text-2" id="text-org4a2483a">
<p>
c-, (control plus comma) can move point from misspelled word to
misspelled word in your buffer. Press c-c $ to correct each one. c-,
will announce when you reach the end of the buffer. Press c-, again to
move to the beginning of the buffer.
</p>
</div>
</div>

<div id="outline-container-orgb89c888" class="outline-2">
<h2 id="orgb89c888">Automatic Correction</h2>
<div class="outline-text-2" id="text-orgb89c888">
<p>
There are other commands which can move point and automatically
correct your misspellings. Since this is automatic, the first choice
may not be the correct one. Once the word has been corrected, you will
need to reread your work to find it.
</p>
</div>
</div>

<div id="outline-container-org7d13348" class="outline-2">
<h2 id="org7d13348">Tip</h2>
<div class="outline-text-2" id="text-org7d13348">
<p>
When moving from misspelled word to misspelled word in your buffer,
Emacspeak will not read out the new misspelled word. Press c-e w to
hear the word. Press c-e w again to have it spelled.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../../15/thinking-about-the-vine/" rel="prev" title="Thinking About the Vine">Previous post</a>
            </li>
            <li class="next">
                <a href="../../20/tab-completion-in-orgmode/" rel="next" title="tab-completion-in-orgmode">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2019         <a href="mailto:">Rill</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


        <script src="../../../../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
